Let's learn more about pandas! Let's load the appropriate library
# Initialize

In [1]:
import pandas as pd
import numpy as np

<font color='red'>To-do:</font> Load nfl_football_profiles.json to pandas df named nfl

In [2]:
nfl = pd.read_json('nfl_football_profiles.json')
nfl

,player_id,name,position,height,weight,current_team,birth_date,birth_place,death_date,college,high_school,draft_team,draft_round,draft_position,draft_year,current_salary,hof_induction_year
0,1809,Robert Blackmon,DB,6-0,208.0,None,1967-05-12,"Bay City, TX",None,Baylor,"Van Vleck, TX",Seattle Seahawks,2.0,34.0,1990.0,None,NaN
1,23586,Dean Wells,LB,6-3,248.0,None,1970-07-20,"Louisville, KY",None,Kentucky,"Holy Cross, KY",Seattle Seahawks,4.0,85.0,1993.0,None,NaN
2,355,Kiko Alonso,ILB,6-3,238.0,Miami Dolphins,1990-08-14,"Newton, MA",None,Oregon,"Los Gatos, CA",Buffalo Bills,2.0,46.0,2013.0,"1,075,000",NaN
3,18182,Steve Ramsey,QB,6-2,210.0,None,1948-04-22,"Dallas, TX",1999-10-15,North Texas,"W.W. Samuell, TX",New Orleans Saints,5.0,126.0,1970.0,None,NaN
4,16250,Cory Nelms,CB,6-0,195.0,None,1988-02-27,"Neptune, NJ",None,Miami (FL),"Neptune, NJ",None,NaN,NaN,NaN,None,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
25038,17925,Felto Prewitt,C-LB,5-11,207.0,None,1924-05-17,"Corsicana, TX",1998-03-15,Tulsa,"Corsicana, TX",Philadelphia Eagles,6.0,48.0,1946.0,None,NaN
25039,10762,Eddie Jackson,DB,6-0,190.0,None,1980-12-19,"Americus, GA",None,Arkansas,"Richardson, TX",None,NaN,NaN,NaN,None,NaN
25040,19343,Ron Sabal,T-G,6-3,245.0,None,1936-07-23,"Chicago, IL",None,Purdue,"St. Rita of Cascia, IL",Philadelphia Eagles,19.0,220.0,1958.0,None,NaN
25041,4880,Darrel Crutchfield,DB,6-0,177.0,None,1979-02-26,"San Diego, CA",None,Clemson,"William M. Raines, FL",None,NaN,NaN,NaN,None,NaN
25042,23865,Will Whitticker,G,6-5,338.0,None,1982-08-02,"Evansville, IN",None,Michigan St.,"Marion, IN",Green Bay Packers,7.0,246.0,2005.0,None,NaN

Lets clean up the data:
Let's remove all the commas in the current_salary column in a new column called salary

In [3]:
nfl['salary'] = nfl['current_salary'].str.replace(',', '')

Let's clean this up further by converting the data type to a float

In [4]:
nfl['salary'] = nfl['salary'].astype(float)

In [5]:
nfl['salary'].head(10)

0          NaN
1          NaN
2    1075000.0
3          NaN
4          NaN
5          NaN
6    1762000.0
7          NaN
8          NaN
9          NaN
Name: salary, dtype: float64

<font color='red'>To-do:</font> Remove all NaN values in salary from the nfl df into a new df called nfl_salary_cleaned

In [6]:
nfl_salary_cleaned = nfl.dropna(subset=['salary'])
# nfl_salary_cleaned['salary'].isna().sum() == 0
nfl_salary_cleaned['salary'].head(10) # show the cleaned dataframe

2      1075000.0
6      1762000.0
13      774294.0
37     6750000.0
53     3750000.0
57      907337.0
90      615000.0
106    4650000.0
113     465000.0
114    2746000.0
Name: salary, dtype: float64

# Dummy variables and discretizing salaries

<font color='red'>To-do:</font> Using the same NFL dataset, lets discretize the salaries. Let's create bins by splitting salaries into five equally sized groups (hint: use pd.Series.quantiles and np.linspace)

In [7]:
bins = nfl_salary_cleaned['salary'].quantile([0, .2, .4, .6, .8, 1])
bins

0.0       38294.0
0.2      465000.0
0.4      615000.0
0.6      800000.0
0.8     1797000.0
1.0    23943600.0
Name: salary, dtype: float64

Using these bins that we set, we can set labels to them and have them categorized by that bin by using pd.cut()

In [8]:
pd.cut(nfl_salary_cleaned['salary'],bins,labels=['d0','d2','d4','d6','d8'])[0:10]

2      d6
6      d6
13     d4
37     d8
53     d8
57     d6
90     d2
106    d8
113    d0
114    d8
Name: salary, dtype: category
Categories (5, object): ['d0' < 'd2' < 'd4' < 'd6' < 'd8']

Similarly, we can create dummy variables to categorize our labels and bins into an organized dataframe by using pd.get_dummies(). It will display whether a player fits into our labels based on their salary bin range.

In [9]:
dummy_variable = pd.get_dummies(pd.cut(nfl_salary_cleaned['salary'],bins,labels=['d0','d2','d4','d6','d8']))

In [10]:
dummy_variable.head()

    d0  d2  d4  d6  d8
2    0   0   0   1   0
6    0   0   0   1   0
13   0   0   1   0   0
37   0   0   0   0   1
53   0   0   0   0   1

# Joining and Merging Datasets

Let's create some simple dataframes

In [11]:
drinks1 = pd.DataFrame({'Drinks': ['Coca-Cola', 'Sprite', 'Fanta', 'Root-Beer', 'Dr. Pepper'],
                   'Prices': [0.99, 1.49, 1.99, 2.49, 5],
                   'id': ['D01', 'D02', 'D03', 'D04', 'D05']})

In [12]:
drinks1.head()

       Drinks  Prices   id
0   Coca-Cola    0.99  D01
1      Sprite    1.49  D02
2       Fanta    1.99  D03
3   Root-Beer    2.49  D04
4  Dr. Pepper    5.00  D05

In [13]:
drinks2 = pd.DataFrame({'Drinks': ['Squirt', 'Ginger-Ale', 'Cream-Soda', 'Pepsi'],
                   'Prices': [0.49, 0.99, 1.99, 1.49],
                   'id': ['D06', 'D07', 'D08', 'D09']})

In [14]:
drinks2.head()

       Drinks  Prices   id
0      Squirt    0.49  D06
1  Ginger-Ale    0.99  D07
2  Cream-Soda    1.99  D08
3       Pepsi    1.49  D09

<font color='red'>To-do:</font> Concatenate drinks1 and drinks2 on rows, but ignore indexes. Show all 9 rows on the df

In [15]:
pd.concat([drinks1, drinks2], ignore_index=True)

       Drinks  Prices   id
0   Coca-Cola    0.99  D01
1      Sprite    1.49  D02
2       Fanta    1.99  D03
3   Root-Beer    2.49  D04
4  Dr. Pepper    5.00  D05
5      Squirt    0.49  D06
6  Ginger-Ale    0.99  D07
7  Cream-Soda    1.99  D08
8       Pepsi    1.49  D09

Now let's practice joining tables. Load in title.ratings.tsv and title.basics.tsv. <font color='red'>These files are included in the zipped file you downloaded with your lab instructions. </font>

In [16]:
ratings = pd.read_csv('title.ratings.tsv', sep='\t')

In [17]:
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.6      1646
1  tt0000002            6.1       198
2  tt0000003            6.5      1345
3  tt0000004            6.2       120
4  tt0000005            6.1      2131

In [18]:
titles = pd.read_csv('title.basics.tsv', sep='\t')

D:\Software\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3146: DtypeWarning: Columns (5) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [19]:
titles.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"

Notice that on titles and ratings, tconst is the same. We can therefore join these two dataframe using that column as index.

<font color='red'>To-do:</font> Merge ratings and titles in a dataframe called imdb_info on tconst. In a markdown cell, explain what kind of join this is and why you chose to use it.

In [30]:
imdb_info = pd.merge(ratings, titles, on = 'tconst')
imdb_info

,tconst,averageRating,numVotes,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,5.6,1646,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,6.1,198,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,6.5,1345,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance"
3,tt0000004,6.2,120,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
4,tt0000005,6.1,2131,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"
...,...,...,...,...,...,...,...,...,...,...,...
1071724,tt9916580,7.2,5,tvEpisode,Horrid Henry Horrid Boy?,Horrid Henry Horrid Boy?,0,2012,\N,10,"Animation,Comedy,Family"
1071725,tt9916690,6.6,5,tvEpisode,Horrid Henry Delivers the Milk,Horrid Henry Delivers the Milk,0,2012,\N,\N,"Animation,Comedy,Family"
1071726,tt9916720,5.8,60,short,The Nun 2,The Nun 2,0,2019,\N,10,"Comedy,Horror,Mystery"
1071727,tt9916766,6.9,14,tvEpisode,Episode #10.15,Episode #10.15,0,2019,\N,43,"Family,Reality-TV"
1071728,tt9916778,7.3,24,tvEpisode,Escape,Escape,0,2019,\N,\N,Drama

It is an `inner join` since we keep only matching rows in column `tconst` in both tables. The reason why I choose the `inner join` method lies in that the data in selected rows are aviliable for both tables. As a result, we will get a complete tables without missin infomations, which is convenient for the future operations.

<font color='red'>To-do:</font> In a markdown cell, explain the difference between an inner join, outer join, right join, and left join.

The difference between four kinds of join are:
+ `inner join`: returns rows when there is a match in both tables.
+ `left join`: returns all rows from the left table, even if there are no matches in the right table.
+ `right join`: returns all rows from the right table, even if there are no matches in the left table.
+ `outer join`: aka `full join` or `full outer join`, combines the results of both left and right outer joins.

(Ref: https://stackoverflow.com/questions/5706437/whats-the-difference-between-inner-join-left-join-right-join-and-full-join)

<font color='red'>To-do:</font> What is the difference between pd.concat and pd.merge?

The major difference is that `pd.concat` is used to append one or more dataframes while `pd.merge` is used for combining two dataframes according to the common columns.

# Exploding, manipulation and grouping practice, YAY!

Let's look at the genres in our imdb_info df. Use explode function to create a row per genre, title pair. (Similar to Q14 in HW1). There also appears to be '\N' tacked onto each of the cells. Let's also get rid of that.

In [73]:
imdb_info.genres = imdb_info.genres.str.extract(r'([a-zA-Z,]*)')
imdb_info.loc[:,"genre_list"] = imdb_info.apply(lambda x: str(x["genres"]).split(","),axis=1)
df_genre = imdb_info.explode("genre_list")
df_genre.rename(columns={'genre_list':'genre'}, inplace=True)

In [74]:
imdb_info.head()

,tconst,averageRating,numVotes,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genre_list
0,tt0000001,5.6,1646,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short","[Documentary, Short]"
1,tt0000002,6.1,198,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short","[Animation, Short]"
2,tt0000003,6.5,1345,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance","[Animation, Comedy, Romance]"
3,tt0000004,6.2,120,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short","[Animation, Short]"
4,tt0000005,6.1,2131,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short","[Comedy, Short]"

Looking at runtimeMinutes, we see that its type is object.

In [75]:
df_genre['runtimeMinutes']

0           1
0           1
1           5
1           5
2           4
           ..
1071726    10
1071726    10
1071727    43
1071727    43
1071728    \N
Name: runtimeMinutes, Length: 2075472, dtype: object

We want to fix the data up a bit more. There appears to be '\\N' tacked onto the end of runtimeMinutes. Let's just grab the number in each of the cells by using some regex

<font color='red'>To-do:</font> Extract the numeric values from the runtimeMinutes column. (HINT: use .str.extract())

In [84]:
df_genre["runtimeMinutes"] = df_genre["runtimeMinutes"].str.extract('(\d+)')
df_genre["runtimeMinutes"]
# df_genre = df_genre.assign(runtimeMinutes = lambda x: x["runtimeMinutes"].str.extract('(\d+)'))
# df_genre["runtimeMinutes"]

0            1
0            1
1            5
1            5
2            4
          ...
1071726     10
1071726     10
1071727     43
1071727     43
1071728    NaN
Name: runtimeMinutes, Length: 2075472, dtype: object

<font color='red'>To-do:</font> Change the object dtype of runtimeMinutes to float.

In [85]:
df_genre["runtimeMinutes"] = df_genre["runtimeMinutes"].str.extract('(\d+)').astype(float)
df_genre["runtimeMinutes"]

0           1.0
0           1.0
1           5.0
1           5.0
2           4.0
           ...
1071726    10.0
1071726    10.0
1071727    43.0
1071727    43.0
1071728     NaN
Name: runtimeMinutes, Length: 2075472, dtype: float64

Let's practice using some groupby on the dataset. Let's look at the df by grouping by the average rating

In [86]:
df_genre.groupby('averageRating').sum()

               numVotes  isAdult  runtimeMinutes
averageRating
1.0              208524        4         26444.0
1.1               34632        9         11054.0
1.2               37745        9         14083.0
1.3              133439        9         15836.0
1.4              250526        3         17615.0
...                 ...      ...             ...
9.6             2590258       44         82023.0
9.7             2603109       17         43255.0
9.8             1293387       35         40721.0
9.9             2526855       11         14948.0
10.0             403865       40         21242.0

[91 rows x 3 columns]

<font color='red'>To-do:</font> Find the average number of votes for averageRating for each genre. Find the first quartile.

In [98]:
avgNumVotes_avgRate_genre = df_genre.groupby(["averageRating", "genre"]).mean()["numVotes"]
qNumVotes_avgRate_genre = df_genre.groupby(["averageRating", "genre"]).quantile(q = 0.25)["numVotes"]

print("The average number of votes for each averageRating and each genre: \n", avgNumVotes_avgRate_genre)
print("--------------------------------------------------------------------------------------------")
print("The first quantile of votes for each averageRating and each genre: \n", qNumVotes_avgRate_genre)

The average number of votes for each averageRating and each genre:
 averageRating  genre
1.0                           21.318182
               Action        873.742424
               Adult           7.666667
               Adventure      10.389222
               Animation       6.783133
                               ...
10.0           Short           9.912548
               Sport          10.793103
               Talk           14.391509
               Thriller     3993.833333
               War            61.500000
Name: numVotes, Length: 2579, dtype: float64
--------------------------------------------------------------------------------------------
The first quantile of votes for each averageRating and each genre:
 averageRating  genre
1.0                          8.25
               Action        7.00
               Adult         6.50
               Adventure     6.00
               Animation     6.00
                            ...
10.0           Short         5.00
               Sport         7.25
               Talk          6.75
               Thriller      5.00
               War          34.75
Name: numVotes, Length: 2579, dtype: float64

<font color='red'>To-do:</font> What is the total number of votes for each genre, for each start year? (hint - use groupby)

In [99]:
totNumVotes_startYear_genre = df_genre.groupby(["startYear", "genre"]).sum()["numVotes"]
print("The total number of votes for each genre and each startYear: \n", totNumVotes_startYear_genre)

The total number of votes for each genre and each startYear:
 startYear  genre
1892       Animation    1663
           Comedy       1345
           Romance      1345
           Short         318
1893       Comedy       2131
                        ...
\N         Short         179
           Sport         100
           Talk           37
           Thriller      725
           nan            10
Name: numVotes, Length: 4903, dtype: int64

# Analysis on Child Opportunity Index

Now let's analyse the child opportunity dataset from the lecture with the tools we've learnt today. But, first let's load the Child Opportunity Index json file from the lecture. Column descriptions can be found at this [link](https://data.diversitydatakids.org/dataset/coi20-child-opportunity-index-2-0-database/resource/f16fff12-b1e5-4f60-85d3-3a0ededa30a0)

In [100]:
opportunity = pd.read_json('raw.json')

<font color='red'>To-do:</font>  Create a dataframe that shows the min, average and maximum median household income in census tracts that belong to a top 100 metropolitan area and those that don't (hint: use groupby and apply to do this)

In [101]:
opportunity

,geoid,year,in100,msaid15,msaname15,countyfips,statefips,stateusps,pop,ED_APENR,...,HE_SUPRFND,HE_RSEI,SE_POVRATE,SE_PUBLIC,SE_HOME,SE_OCC,SE_MHE,SE_EMPRAT,SE_JOBPROX,SE_SINGLE
0,1001020100,2010,0.0,33860.0,"Montgomery, AL Metro Area",1001,1,AL,424,0.349463,...,-13.815511,5.933720,9.240363,14.398734,84.335442,27.972027,60321.0,68.187744,5.224787,17.256638
1,1001020100,2015,0.0,33860.0,"Montgomery, AL Metro Area",1001,1,AL,414,0.252991,...,-13.815511,7.015026,10.677506,12.068965,75.198936,38.479000,67826.0,82.987556,1.052632,26.556019
2,1001020200,2010,0.0,33860.0,"Montgomery, AL Metro Area",1001,1,AL,497,0.350239,...,-13.815511,6.083863,10.511090,13.028169,58.568073,40.000000,44039.0,59.521217,1.727862,48.818897
3,1001020200,2015,0.0,33860.0,"Montgomery, AL Metro Area",1001,1,AL,508,0.253207,...,-13.815511,7.306938,22.413794,24.137930,61.941254,30.516430,41287.0,60.339661,0.931315,47.470818
4,1001020300,2010,0.0,33860.0,"Montgomery, AL Metro Area",1001,1,AL,878,0.349768,...,-13.815511,6.162114,11.823454,9.035088,76.315788,31.036932,46002.0,82.875099,1.788375,31.969309
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
146107,56043000302,2015,NaN,NaN,None,56043,56,WY,706,0.221675,...,-13.815511,5.326058,14.899487,8.024072,76.028084,32.825882,52214.0,70.059875,7.700206,12.012987
146108,56045951100,2010,NaN,NaN,None,56045,56,WY,638,0.000000,...,-13.815511,1.225840,10.197711,3.453947,80.838814,26.534653,68768.0,70.643524,31.721613,25.000000
146109,56045951100,2015,NaN,NaN,None,56045,56,WY,577,0.192535,...,-13.815511,0.469633,12.532808,4.201102,78.925621,32.217308,62435.0,73.387695,23.780487,33.514984
146110,56045951300,2010,NaN,NaN,None,56045,56,WY,954,0.000000,...,-13.815511,4.060935,16.489092,5.855339,77.324913,25.696268,50070.0,84.599152,17.847338,35.205181
146111,56045951300,2015,NaN,NaN,None,56045,56,WY,922,0.000000,...,-13.815511,3.086356,15.929919,8.381503,74.624275,31.743422,54074.0,82.461784,17.639902,33.479214

In [126]:
# the column related: in100(in top 100 metropolitan area), SE_MHE(median household income)
# In this question, I do not think apply function is necessary 
# or if there is a way to apply multiple functions?
min_MHE = opportunity.groupby(["in100"]).apply(min)["SE_MHE"]
mean_MHE = opportunity.groupby(["in100"]).mean()["SE_MHE"]
max_MHE = opportunity.groupby(["in100"]).apply(max)["SE_MHE"]
print("The min, average and maximum median household income belong to a top 100 metro or not are: \n", 
     min_MHE, "\n", mean_MHE, "\n", max_MHE)
print("(The result does not include those located outside a metro- or micropolitan area.)")

The min, average and maximum median household income belong to a top 100 metro or not are:
 in100
0.0    2499.0
1.0    2499.0
Name: SE_MHE, dtype: float64
 in100
0.0    51280.497588
1.0    67220.144778
Name: SE_MHE, dtype: float64
 in100
0.0    254394.0
1.0    266907.0
Name: SE_MHE, dtype: float64
(The result does not include those located outside a metro- or micropolitan area.)

<font color='red'>To-do:</font> Create a a new column in the dataframe by bucketing the median household income into 4 equal sized in terms of number of rows groups (hint use pd.Series.quantile function) "low_mhe","low-medium_mhe", "high-medium_mhe", and "high_mhe".

In [119]:
bins = opportunity["SE_MHE"].quantile([0, .25, .5, .75, 1])
opportunity["MHE_level"] = pd.cut(opportunity["SE_MHE"], 
                                  bins, 
                                  labels=["low_mhe","low-medium_mhe", "high-medium_mhe", "high_mhe"])
opportunity.head()

,geoid,year,in100,msaid15,msaname15,countyfips,statefips,stateusps,pop,ED_APENR,...,HE_RSEI,SE_POVRATE,SE_PUBLIC,SE_HOME,SE_OCC,SE_MHE,SE_EMPRAT,SE_JOBPROX,SE_SINGLE,MHE_level
0,1001020100,2010,0.0,33860.0,"Montgomery, AL Metro Area",1001,1,AL,424,0.349463,...,5.933720,9.240363,14.398734,84.335442,27.972027,60321.0,68.187744,5.224787,17.256638,high-medium_mhe
1,1001020100,2015,0.0,33860.0,"Montgomery, AL Metro Area",1001,1,AL,414,0.252991,...,7.015026,10.677506,12.068965,75.198936,38.479000,67826.0,82.987556,1.052632,26.556019,high-medium_mhe
2,1001020200,2010,0.0,33860.0,"Montgomery, AL Metro Area",1001,1,AL,497,0.350239,...,6.083863,10.511090,13.028169,58.568073,40.000000,44039.0,59.521217,1.727862,48.818897,low-medium_mhe
3,1001020200,2015,0.0,33860.0,"Montgomery, AL Metro Area",1001,1,AL,508,0.253207,...,7.306938,22.413794,24.137930,61.941254,30.516430,41287.0,60.339661,0.931315,47.470818,low-medium_mhe
4,1001020300,2010,0.0,33860.0,"Montgomery, AL Metro Area",1001,1,AL,878,0.349768,...,6.162114,11.823454,9.035088,76.315788,31.036932,46002.0,82.875099,1.788375,31.969309,low-medium_mhe

<font color='red'>To-do:</font> Now create a table such that the index corresponds to whether a census tract belongs to top 100 metropolitan area, the columns correspond to the median household income bucket and the values correspond to average third-grade math proficiency. As a challenge, consider what you may be able say about (i) the relationship between household income and math proficiency of children as a whole and (ii) how this relationship differs between big cities and elsewehere?

In [130]:
# the column related: in100(in top 100 metropolitan area), 
# SE_MHE(median household income), ED_MATH(Third grade math proficiency)

MATH_gb_in100_MHE = opportunity.groupby(["in100", "MHE_level"]).mean()["ED_MATH"]
print("The average third-grade math proficiency according to location and MHE level is: \n", 
     MATH_gb_in100_MHE)
print("(The result does not include those located outside a metro- or micropolitan area.)")

The average third-grade math proficiency according to location and MHE level is:
 in100  MHE_level
0.0    low_mhe            205.024781
       low-medium_mhe     220.900619
       high-medium_mhe    229.021845
       high_mhe           242.240327
1.0    low_mhe            177.554489
       low-medium_mhe     205.821513
       high-medium_mhe    224.600362
       high_mhe           257.436952
Name: ED_MATH, dtype: float64
(The result does not include those located outside a metro- or micropolitan area.)

Answer:

(i) The higher household income a family has, the higher math proficiency its children appears to be in.

(ii) For big cities (`in100` = 1), there exist a larger difference of math proficiency from different levels of household income. In another word, children in larger cities appears to have a larger gap of math proficiency according to which MHE level they belong to. However, the difference of math proficiency appears to be smaller than bigger cities.